# Day Objectivies
## Date: 30-10-2019
### Pandas

In [ ]:
# pandas:-> pandas stands for "python data analysis library".
# uses:-
#  1.It is a open source library.
#  2.It is used for data manipulations and analysis.
# It deals with two different data structures.
#   1.series ->It is used to store the data in 1-d Array.
#   2.DataFrame -> It is used to store the data in 2-d Array.

In [3]:
data={'s1':10,'s2':20}
res=pd.Series(data)
print(res)

s1    10
s2    20
dtype: int64

In [6]:
data={'rollnumber':[510,520,530],'name':['narmada','mani','ramya'],'marks':[50,60,100]}
df=pd.DataFrame(data)
print(df)

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100

In [7]:
# To get column names using 'columns'
df.columns

Index(['rollnumber', 'name', 'marks'], dtype='object')

In [8]:
# To get only values from the Dataframes using 'values'
df.values

array([[510, 'narmada', 50],
       [520, 'mani', 60],
       [530, 'ramya', 100]], dtype=object)

In [9]:
# To access only specific column name
df['name']

0    narmada
1       mani
2      ramya
Name: name, dtype: object

In [11]:
df.values[2][2]

100

In [12]:
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100

In [13]:
df.values[1,1]

'mani'

In [14]:
# To add newrow
df.loc[3]=[540,'apssdc',45]
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
2         530    ramya    100
3         540   apssdc     45

In [17]:
df=df.drop(2)

In [18]:
df

   rollnumber     name  marks
0         510  narmada     50
1         520     mani     60
3         540   apssdc     45

In [31]:
# function to create a read data from csv file
def read_Csvdata(filepath):
    df=pd.read_csv(filepath)
    return df
read_Csvdata('studentdata.csv')

      name  rollnumber  marks
0  narmada         510     56
1   apssdc         520     45
2      sai         533     60
3  lavanya         540     70

In [33]:
res=read_Csvdata('studentdata.csv')

In [22]:
for i in df.values:
    print(i)

[510 'narmada' 50]
[520 'mani' 60]
[540 'apssdc' 45]

In [41]:
def get_row_index(filepath,rowkey):
#     df=pd.read_csv('studentdata.csv')
    for i in range(len(res.values)):
        if res.values[i][0]==rowkey or res.values[i][1]==rowkey:
            row_index=i
    return row_index
get_row_index('studentdata.csv','narmada')

0

In [39]:
def get_column_index(filepath,colkey):
    for i in range(len(res.columns)):
        if res.columns[i]==colkey:
            col_index=i
    return col_index
get_column_index('studentdata.csv','marks')

2

In [43]:
# to print specific value
def get_Specific_value(filepath,rowkey,colkey):
    ri=get_row_index(filepath,rowkey) # it return row index
    ci=get_column_index(filepath,colkey) # it return column index
    return res.values[ri][ci]
get_Specific_value('studentdata.csv','narmada','marks')

56

In [44]:
res.columns[0]

'name'

In [45]:
# Practice on Income Dataset
# Define functions for the following data points
# Combined Average Income of all states from 2005 to 2013
# Answer = 48525
# State with highest average income in the last three years
# Answer = Alaska
# State with lowest average income from 2007 to 2010(inclusive)
# Answer = Arkansas
# Print the list of all states in the same line with average income less than California
# Answer = Alabama Arizona Arkansas 
# Print the names of states based on descending order of income in the year 2009
# Answer = Alaska California Arizona Alabama Arkansas
# State with the lowest recorded income from 2005 to 2013
# Answer = Arkansas

In [57]:
df = pd.read_csv('income.csv')
df.tail(3)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [50]:
data={'name':['narmada','mani'],'marks':[100,200]}
df = pd.DataFrame(data)
df.to_csv('data5.csv',index=False)
print('success')

success

In [51]:
df

      name  marks
0  narmada    100
1     mani    200

In [54]:
df.head()

      name  marks
0  narmada    100
1     mani    200

In [53]:
df.tail(1)

   name  marks
1  mani    200

In [68]:
df=pd.read_csv('https://raw.githubusercontent.com/mastan511/Apssdc-Python-Programming/master/DataFiles/income.csv')
df

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528